app/views/users/dashboard.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
      <td><%= sale.created_at.strftime("%B %e, %Y") %></td>
      <td><%= sale.user.first_name %> <%= sale.user.last_name %></td>

SELECT "shoes".* FROM "shoes"  WHERE "shoes"."user_id" = $1 AND ("shoes"."id" NOT IN (3))  [["user_id", 1]]
---
      <td><%= purchase.created_at.strftime("%B %e, %Y") %></td>
      <td><%= purchase.shoe.user.first_name %> <%= purchase.shoe.user.last_name %></td>