app/views/events/show.html.erb

    <li><b>Location:</b> <%=@event.city%>, <%=@event.state%> </li>
    <li><b>People who are joining the event:</b> <%=@event.users.count%> </li>
---
SELECT "users".* FROM "users" INNER JOIN "rosters" ON "users"."id" = "rosters"."user_id" WHERE "rosters"."event_id" = $1  [["event_id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "rosters" ON "users"."id" = "rosters"."user_id" WHERE "rosters"."event_id" = $1  [["event_id", 2]]

  <div id="comments">
    <% @event.comments.each do |c| %>
      <p><b><%=c.user.first_name%> says:</b> <%=c.comment%></p>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."event_id" = $1  [["event_id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]