app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(comment: params[:comment]['comment'], user: current_user, event: Event.find(params[:comment]['event_id']))
---
INSERT INTO "comments" ("comment", "created_at", "event_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "asdf"], ["created_at", "2016-12-14 03:00:13.074275"], ["event_id", 2], ["updated_at", "2016-12-14 03:00:13.074275"], ["user_id", 4]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]