app/controllers/events_controller.rb

SELECT "events".* FROM "events"  WHERE ("events"."state" != 'OH') AND (date >= '2016-12-13')  ORDER BY "events"."date" ASC
SELECT "users".* FROM "users"  WHERE "users"."id" IN (4)
---
  def index
    @in_state_events= Event.where(state: current_user.state).where('date >= ?', today).includes(:host, :users).order(:date)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "events" ("city", "created_at", "date", "name", "state", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.find(current_user.id)
    @event = @user.events.create(event_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    Event.find(params[:id]).destroy