app/controllers/purchases_controller.rb

SELECT  "shoes".* FROM "shoes"  WHERE "shoes"."id" = $1 LIMIT 1  [["id", 0]]
INSERT INTO "purchases" ("created_at", "shoe_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-12-15 16:38:02.034565"], ["shoe_id", 3], ["updated_at", "2016-12-15 16:38:02.034565"], ["user_id", 1]]
---
  def create
    shoe = Shoe.find(params[:shoe_id])
    Purchase.create(user: current_user, shoe: shoe)