app/controllers/rosters_controller.rb

INSERT INTO "rosters" ("created_at", "event_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-12-14 03:02:08.254506"], ["event_id", 2], ["updated_at", "2016-12-14 03:02:08.254506"], ["user_id", 4]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
  def create
    Roster.create(user: current_user, event: Event.find(params[:event_id]))

DELETE FROM "rosters" WHERE "rosters"."id" = $1  [["id", 1]]
SELECT  "rosters".* FROM "rosters"  WHERE "rosters"."user_id" = 4 AND "rosters"."event_id" = 2 LIMIT 1
---
  def destroy
    Roster.find_by(user: current_user, event: Event.find(params[:event_id])).destroy