app/controllers/shoes_controller.rb

SELECT "purchases"."shoe_id" FROM "purchases"
SELECT "shoes".* FROM "shoes"  WHERE (1=1)
---
  def index
    sold = Purchase.all.pluck('shoe_id')
    @shoes = Shoe.where.not(id: sold)

INSERT INTO "shoes" ("created_at", "name", "price", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-12-15 16:35:39.641684"], ["name", "Nike"], ["price", "300.0"], ["updated_at", "2016-12-15 16:35:39.641684"], ["user_id", 1]]
---
  def create
    product = Shoe.create(shoe_params.merge({user: current_user}))

DELETE FROM "shoes" WHERE "shoes"."id" = $1  [["id", 2]]
---
  def destroy
    Shoe.destroy(params[:shoe_id])