app/controllers/users_controller.rb

INSERT INTO "users" ("birthday", "city", "created_at", "description", "email", "first_name", "last_name", "password_digest", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT "shoes".* FROM "shoes"  WHERE "shoes"."user_id" = $1 AND ("shoes"."id" NOT IN (3))  [["user_id", 1]]
SELECT "users".* FROM "users"  WHERE "users"."id" IN (1)
SELECT price FROM "purchases" LEFT OUTER JOIN "users" ON "users"."id" = "purchases"."user_id" LEFT OUTER JOIN "shoes" ON "shoes"."id" = "purchases"."shoe_id" WHERE "purchases"."shoe_id" IN (SELECT "shoes"."id" FROM "shoes"  WHERE "shoes"."user_id" = $1)  [["user_id", 3]]
SELECT "purchases"."shoe_id" FROM "purchases" LEFT OUTER JOIN "users" ON "users"."id" = "purchases"."user_id" LEFT OUTER JOIN "shoes" ON "shoes"."id" = "purchases"."shoe_id" WHERE "purchases"."shoe_id" IN (SELECT "shoes"."id" FROM "shoes"  WHERE "shoes"."user_id" = $1)  [["user_id", 1]]
SELECT "purchases".* FROM "purchases"  WHERE "purchases"."user_id" = 1
---
  def dashboard
    my_shoes = current_user.shoes

    @sales = Purchase.where(shoe: my_shoes).includes(:user, :shoe)
    sold = @sales.pluck('shoe_id')
    @total_sales = @sales.pluck('price').inject(0){ |sum, x| sum + x}

    @on_sale = my_shoes.where.not(id: sold)

    @purchases = Purchase.where(user: current_user).includes(:user, :shoe)