app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = 4  [["first_name", "test333"], ["updated_at", "2016-12-13 19:29:22.014105"]]
---
  def update
    @user = User.find(current_user.id)
    success = @user.update(user_params)