app/views/shoes/index.html.erb

      <td><%= shoe.name %></td>
      <td><%= shoe.user.first_name  %> <%= shoe.user.last_name %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]